Revit 2024 API
BuiltInFailures.EditingFailures.BorrowElementsAtRisk Property
 Can't obtain permission to edit the element: The Central Model is inaccessible. You can check out worksets at risk, but consider carefully!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BorrowElementsAtRisk { get; }
Visual Basic
Public Shared ReadOnly Property BorrowElementsAtRisk As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BorrowElementsAtRisk {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace